Revit 2027 API
ElectricalAnalyticalNode.Create Method
 Creates an electrical analytical node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElectricalAnalyticalNode Create(
	Document document,
	ElectricalAnalyticalNodeType type,
	string name
)
Public Shared Function Create (
	document As Document,
	type As ElectricalAnalyticalNodeType,
	name As String
) As ElectricalAnalyticalNode
public:
static ElectricalAnalyticalNode^ Create(
	Document^ document,
	ElectricalAnalyticalNodeType type,
	String^ name
)
static member Create :
        document : Document *
        type : ElectricalAnalyticalNodeType *
        name : string -> ElectricalAnalyticalNode
Parameters
document Document
 The document where the new element will be created.
type ElectricalAnalyticalNodeType
 The type of electrical analytical node to be created.
name String
 The name of new electrical analytical node. The actual name may be post-fixed if already exists.
Return Value
ElectricalAnalyticalNode
 The newly created electrical analytical node.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- name is an empty string.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Reference
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace